; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	image2 - mode
	image0 - mode
	infrared1 - mode
	spectrograph3 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation7 - direction
	Star5 - direction
	Star4 - direction
	Star6 - direction
	Star2 - direction
	GroundStation3 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument2 image2)
	(calibration_target instrument2 Star2)
	(supports instrument3 spectrograph3)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star5)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 Star6)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
	(supports instrument5 infrared1)
	(supports instrument5 image2)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
)
(:goal (and
	(pointing satellite0 Phenomenon15)
	(pointing satellite1 GroundStation0)
	(have_image Planet9 image2)
	(have_image Planet10 spectrograph3)
	(have_image Star11 image0)
	(have_image Planet12 infrared1)
	(have_image Star13 image2)
	(have_image Phenomenon14 spectrograph3)
	(have_image Phenomenon15 spectrograph3)
))

)

; plan
1. (turn_to satellite1 star4 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star4)
   goals met: 0 of 9
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 9
3. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 0 of 9
4. (turn_to satellite1 phenomenon15 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon15)
   goals met: 0 of 9
5. (take_image satellite1 phenomenon15 instrument3 spectrograph3)
   added: (have_image phenomenon15 spectrograph3)
   goals met: 1 of 9
6. (turn_to satellite1 phenomenon14 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon14)
   goals met: 1 of 9
7. (turn_to satellite0 groundstation3 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 9
8. (take_image satellite1 phenomenon14 instrument3 spectrograph3)
   added: (have_image phenomenon14 spectrograph3)
   goals met: 2 of 9
9. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 9
10. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 2 of 9
11. (turn_to satellite0 planet9 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet9)
   goals met: 2 of 9
12. (take_image satellite0 planet9 instrument1 image2)
   added: (have_image planet9 image2)
   goals met: 3 of 9
13. (turn_to satellite0 star11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star11)
   goals met: 3 of 9
14. (take_image satellite0 star11 instrument1 image0)
   added: (have_image star11 image0)
   goals met: 4 of 9
15. (turn_to satellite0 star13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star13)
   goals met: 4 of 9
16. (take_image satellite0 star13 instrument1 image2)
   added: (have_image star13 image2)
   goals met: 5 of 9
17. (turn_to satellite0 phenomenon15 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 phenomenon15)
   goals met: 6 of 9
18. (turn_to satellite1 planet10 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 planet10)
   goals met: 6 of 9
19. (take_image satellite1 planet10 instrument3 spectrograph3)
   added: (have_image planet10 spectrograph3)
   goals met: 7 of 9
20. (turn_to satellite1 planet12 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet12)
   goals met: 7 of 9
21. (take_image satellite1 planet12 instrument3 infrared1)
   added: (have_image planet12 infrared1)
   goals met: 8 of 9
22. (turn_to satellite1 groundstation0 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 groundstation0)
   goals met: 9 of 9
